Repository: pozsarzs/ctt-sw
Catalog: languages/*/ctt.po
Languages: hu

source: pin-out:
hu: lábkiosztás:

source: Missing default configuration file!
hu: Hiányzó beállítás fájl!

source: Cannot write the user's configuration file!
hu: A felhasználó beállítása nem menthető!

source: Please check browser application setting!
hu: Ellenőrizze a megadott böngésző alkalmazást!

source: Please check mailer application setting!
hu: Ellenőrizze a megadott levelező alkalmazást!

source: Missing palette file!
hu: Hiányzó színbeállítások!

# commonproc.message06
source: Missing files! Please reinstall CTT!
hu: Hiányzó fájlok! Telepítse újra az alkalmazást.

source: Cannot write temporary file!
hu: Ideiglenes állomány nem hozható létre!

source: Cannot read temporary file!
hu: Nem sikerült olvasni az átmeneti fájlból

source: Minimum value is 4 uA for "Auto value"
hu: A minimum érték 4 uA az "Auto beállításhoz"

source: Full
hu: Teljes

source: New version is available. Please visit CTT's homepage!
hu: Új változat elérhető. Kérem, látogassa meg a CTT honlapját!

# frmmain.message06
source: Open original profile
hu: Eredeti profil megnyitás

source: Save profile as
hu: Profil mentés másként

source: Profile files (*.pro)|*.pro|
hu: Profil állományok (*.pro)|*.pro|

source: File is exist. Replace?
hu: A fájl létezik, felülírjam?

# frmmain.message10
source: new profile
hu: új profil

source: Save recent profile?
hu: Mentsem az jelenlegi profilt?

source: Num
hu: Szám

source: Box
hu: Doboz

source: Compartment of the sorting box
hu: Válogató doboz rekesze

source: base
hu: bázis

source: collector
hu: kollektor

source: shield/metal package
hu: árnyékolás, fémház

source: none
hu: nincs

# frmmain.message21
source: Missing files! Please reinstall CTT!
hu: Hiányzó fájlok! Telepítse újra az alkalmazást.

source: There is not newer version!
hu: Nincs újabb változat.

# frmmain.message23
source: (description)
hu: (leírás)

source: Open own profile
hu: Saját profil megnyitása

source: Profile load error, creating a new one
hu: Profil megnyitási hiba, készítek egy üreset.

source: Invalid or missing hardware!
hu: Érvénytelen vagy hiányzó hardver!

# frmmain.message28
source: Save result in BMP format
hu: Eredmény mentés BMP formátumban

# frmmain.message29
source: Save result in TXT format
hu: Eredmény mentés TXT formátumban

source: Bitmap files (*.bmp)|*.bmp|
hu: Bitkép (*.bmp)|*.bmp|

source: Text files (*.txt)|*.txt|
hu: Szöveges állomány (*.txt)|*.txt|

source: Cannot save this file!
hu: Sajnálom, nem tudtam elmenteni ezt a fájlt.

source: Connect a transistor to tester and press OK!
hu: Csatlakoztasson egy tranzisztort a teszterhez és nyomja meg az OK-t!

source: Put it to this compartment: #
hu: Tegye a következő rekeszbe:

source: Set aside...
hu: Tegye félre...

source: resolution:
hu: felbontás:

source: Bipolar transistor input characteristic
hu: Bipoláris tranzisztor bemeneti karakterisztikája

source: Bipolar transistor output characteristic
hu: Bipoláris tranzisztor kimeneti karakterisztikája

source: This application is a demo version of the CTT.
hu: Ez az alkalmazás a CTT előzetes demó kiadása.

source: You can view and test the application, but you can not measure.
hu: Megtekintheti és kipróbálhatja, de mérésre nem alkalmas.

source: Select browser application
hu: Válasszon böngészőt

source: Select mailer application
hu: Válasszon levelezőt

source: executables|*.exe|all files|*.*
hu: alkalmazások|*.exe|minden fájl|*.*

source: all files|*.*
hu: minden fájl|*.*

source: white
hu: fehér

source: yellow
hu: sárga

source: red
hu: vörös

source: green
hu: zöld

source: blue
hu: kék

source: black
hu: fekete

# tform1.bitbtn6.caption
source: &Clear
hu: &Törlés

# TFORM1.BITBTN7.CAPTION
source: &Clear
hu: &Törlés

# tform1.button1.caption
source: &Start
hu: In&dítás

# TFORM1.BUTTON10.CAPTION
source: &Start
hu: In&dítás

# TFORM1.BUTTON11.CAPTION
source: &Clear
hu: &Törlés

# tform1.button2.caption
source: Start
hu: Indítás

# TFORM1.BUTTON3.CAPTION
source: Start
hu: Indítás

# TFORM1.BUTTON4.CAPTION
source: Start
hu: Indítás

# TFORM1.BUTTON5.CAPTION
source: Start
hu: Indítás

# TFORM1.BUTTON6.CAPTION
source: Start
hu: Indítás

# TFORM1.BUTTON7.CAPTION
source: &Start
hu: In&dítás

# tform1.button8.caption
source: &Details...
hu: Rés&zletek

# TFORM1.BUTTON9.CAPTION
source: &Details...
hu: Rés&zletek

source: CTT - new profile
hu: CTT - új profil

# tform1.edit1.text
source: (description)
hu: (leírás)

# tform1.edit2.text
source: new profile
hu: új profil

source: Maximal collector-emitter voltage by catalog
hu: Maximális kollektor-emitter feszültség a katalógusból

source: Maximal collector-base voltage by catalog
hu: Maximális kollektor-bázis feszültség a katalógusból

source: Maximal collector current by catalog
hu: Maximális kollektoráram a katalógusból

source: Maximal base current by catalog
hu: Maximális bázisáram a katalógusból

source: Maximal dissipation power by catalog
hu: Maximális disszipációs teljesítmény

source: Type:
hu: Típus:

source: Pin #5:
hu: 5. láb:

source: Pin #3:
hu: 3. láb:

source: Pin #4:
hu: 4. láb:

source: Package &
hu: Tokozás és

source: Pin #6:
hu: 6. láb:

source: Pin #7:
hu: 7. láb:

source: Warning!
hu: Figyelem!

source: This measurement can destroy the transistor!
hu: Ez a mérés tönkreteheti a tranzisztort!

source: Pin #1:
hu: 1. láb:

source: Breakdown voltage
hu: Letörési feszültség

source: Reverse current
hu: Szivárgóáram

source: Tolerance:
hu: Tűrés:

source: Measure voltage: 100V
hu: Mérőfeszültség: 100V

source: Measure voltage: 6V
hu: Mérőfeszültség: 6V

source: Polarity
hu: Polaritás

source: Pin #2:
hu: 2. láb:

source: &File
hu: &Fájl

# TFORM1.MENUITEM10.CAPTION
source: &Help
hu: &Súgó

source: See home&page
hu: &Honlap

# TFORM1.MENUITEM16.CAPTION
source: &Save profile
hu: Profil mentése &másként

source: &Open profile
hu: Pr&ofil megnyitás

# TFORM1.MENUITEM18.CAPTION
source: &New profile
hu: Ú&j profil

source: &Operation
hu: Műkö&dés

source: Search &update
hu: F&rissítés keresés

# TFORM1.MENUITEM21.CAPTION
source: &Original profiles
hu: Eredeti pr&ofilok

source: &Parameters
hu: &Paraméterek

source: &Base characteristic
hu: &Bázis karakterisztika

source: &Pair select
hu: &Párbaválogatás

source: &Preferences...
hu: B&eállítások

# TFORM1.MENUITEM27.CAPTION
source: &My profiles
hu: Saját pro&filok

source: Save profile &as...
hu: Profil mentés m&ásként

source: Save &result
hu: E&redmény mentés

# tform1.menuitem3.caption
source: &Help
hu: &Súgó

# TFORM1.MENUITEM30.CAPTION
source: as &picture (BMP)
hu: ké&pként (BMP)

# TFORM1.MENUITEM31.CAPTION
source: as data (TXT)
hu: adatként (TXT)

source: &View
hu: &Nézet

# TFORM1.MENUITEM38.CAPTION
source: Toggle &grid
hu: &Rács be/ki

# TFORM1.MENUITEM39.CAPTION
source: Toggle &header
hu: Fejlé&c be/ki

source: &Quit
hu: &Kilépés

source: &Collector characteristic
hu: &Kollektor karakterisztika

source: Re&fresh displays
hu: Kijelzők &frissítése

source: &Clear all display
hu: Összes kijelző tör&lése

source: &About...
hu: &Névjegy

source: Parameters
hu: Paraméterek

# TFORM1.TABSHEET2.CAPTION
source: Base characteristic
hu: Bázis karakterisztika

source: Pair select
hu: Párbaválogatás

# TFORM1.TABSHEET4.CAPTION
source: Collector characteristic
hu: Kollektor karakterisztika

# tform1.toolbutton1.caption
source: &New profile
hu: Ú&j profil

source: Create new profile
hu: Új profil létrehozása

# tform1.toolbutton10.caption
source: Toggle &grid
hu: &Rács be/ki

source: Toggle grid
hu: Rács be/ki

source: Re&fresh
hu: &Frissítés

source: Refresh displays
hu: Kijelzők frissítése

# tform1.toolbutton2.caption
source: &Original profiles
hu: Eredeti pr&ofilok

# tform1.toolbutton2.hint
source: Open original profile
hu: Eredeti profil megnyitás

# tform1.toolbutton3.caption
source: &My profiles
hu: Saját pro&filok

source: Open my profile
hu: Saját profil megnyitás

# tform1.toolbutton4.caption
source: &Save profile
hu: Profil mentése &másként

source: Save profile
hu: Profil mentés

# tform1.toolbutton5.caption
source: as &picture (BMP)
hu: ké&pként (BMP)

# tform1.toolbutton5.hint
source: Save result in BMP format
hu: Eredmény mentés BMP formátumban

# tform1.toolbutton6.caption
source: as data (TXT)
hu: adatként (TXT)

# tform1.toolbutton6.hint
source: Save result in TXT format
hu: Eredmény mentés TXT formátumban

# tform1.toolbutton9.caption
source: Toggle &header
hu: Fejlé&c be/ki

source: Toggle header
hu: Fejléc be/ki

source: Close
hu: Bezárás

source: About
hu: Névjegy

source: Transistor tester and characteristic curve plotter
hu: Tranzisztor teszter és jelleggörbe rajzoló

source: Homepage:
hu: Honlap:

source: http://www.pozsarzs.hu
hu: A letöltéshez látogassa meg a http://www.pozsarzs.hu-t.

source: &Set
hu: &Beállít

source: &Cancel
hu: &Mégsem

source: Preferences
hu: Beállítások

source: Offline mode
hu: Off-line mód

source: Browser application:
hu: Böngésző alkalmazás:

source: Mailer application:
hu: Levelező alkalmazás:

source: Display color
hu: Kijelzőszín

source: Details
hu: Részletek

source: Auto value
hu: Auto beállítás

source: Check to set Ib2-4 automatically
hu: Jelöld be az Ib2-4 automata beállításához

source: Constant collector-emitter voltage
hu: Állandó kollektor-emitter feszültség

source: Maximal base current
hu: Maximális bázisáram

# tform5.floatspinedit3.hint
source: Constant base current
hu: Állandó bázisáram

# TFORM5.FLOATSPINEDIT5.HINT
source: Constant base current
hu: Állandó bázisáram

# TFORM5.FLOATSPINEDIT6.HINT
source: Constant base current
hu: Állandó bázisáram

# TFORM5.FLOATSPINEDIT7.HINT
source: Constant base current
hu: Állandó bázisáram

source: Maximal collector-emitter voltage
hu: Maximális kollektor-emitter feszültség

# tform5.groupbox1.caption
source: Base characteristic
hu: Bázis karakterisztika

# tform5.groupbox2.caption
source: Collector characteristic
hu: Kollektor karakterisztika

source: * At measure, CTT increments it from zero to maximal value.
hu: A mérés alatt a CTT nullától a maximális értékig növeli.
